validation_cases/workshop2/vortexShedding/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         350;

deltaT          0.05;

writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forces
    {
	      type forces;
	      functionObjectLibs ("libforces.so");

	      writeControl   timeStep;
	      writeInterval  1;

	      //-- Patches to sample
	      patches ("cylinder");

	      //-- Name of fields
	      pName p;
	      Uname U;

	      //-- Density
	      rho rhoInf;
	      rhoInf 1.;

	      //-- Centre of rotation
	      CofR (0 0 0);
    }

    forceCoeffs
    {
	      type forceCoeffs;
	      functionObjectLibs ("libforces.so");
	      patches (cylinder);

	      pName p;
	      Uname U;
	      
	      //-- reference density
	      rho rhoInf;
	      rhoInf 1.0;

	      //-- Dump to file
	      log true;
        
        //-- Centre of rotation
	      CofR (0 0 0);
	      //-- Direction of lift coefficient
	      liftDir (0 1 0);
	      // dragDir - Direction of drag coefficient
	      dragDir (1 0 0);
	      //-- Pitching moment axis
	      pitchAxis (0 0 1);
	      // magUinf - free stream velocity magnitude
	      magUInf 1.0;
	      //-- reference length
	      lRef 1.0;
	      //-- reference area
	      Aref 2.0;

        writeControl   timeStep;
        writeInterval  1;
    }
};

// ************************************************************************* //
