validation_cases/workshop2/vortexShedding/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/parameters"

constructFrom mesh;
sourceCase "$FOAM_CASE";
sourcePatches (outlet);

flipNormals false;

extrudeModel        linearDirection;

nLayers             $ext;
expansionRatio      1.01;

linearDirectionCoeffs
{
    axisPt          (0 0 0);
    direction       (1 0 0);
    thickness       $outr;
}

mergeFaces false;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
