validation_cases/workshop2/vortexShedding/system/mirrorMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          mirrorMeshDict;
}

planeType       pointAndNormal;

pointAndNormalDict
{
    basePoint       ( 0 0 0 );
    normalVector    ( 0 1 0 );
}

planeTolerance  0.001;


// ************************************************************************* //
