validation_cases/workshop2/vortexShedding/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/parameters"

actions
(
    {
        name    outletSet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box
                (#calc "$outr - 0.25*$len" #calc "-$outr - 0.5*$len" $zb)
                (#calc "$outr + 0.25*$len" #calc "$outr + 0.5*$len" $zf);
        }
    }
);

// ************************************************************************* //
